In [1]:
%load_ext sql

In [2]:
%sql sqlite:///db_univ7.db

In [3]:
%sql select * from sqlite_master;

 * sqlite:///db_univ7.db
Done.

[('table', 'classroom', 'classroom', 2, 'CREATE TABLE classroom\n\t(building\t\tvarchar(15),\n\t room_number\t\tvarchar(7),\n\t capacity\t\tnumeric(4,0),\n\t primary key (building, room_number)\n\t)'),
 ('index', 'sqlite_autoindex_classroom_1', 'classroom', 3, None),
 ('table', 'department', 'department', 4, 'CREATE TABLE department\n\t(dept_name\t\tvarchar(20), \n\t building\t\tvarchar(15), \n\t budget\t\t        numeric(12,2) check (budget > 0),\n\t primary key (dept_name)\n\t)'),
 ('index', 'sqlite_autoindex_department_1', 'department', 5, None),
 ('table', 'course', 'course', 6, 'CREATE TABLE course\n\t(course_id\t\tvarchar(8), \n\t title\t\t\tvarchar(50), \n\t dept_name\t\tvarchar(20),\n\t credits\t\tnumeric(2,0) check (credits > 0),\n\t primary key (course_id),\n\t foreign key (dept_name) references department (dept_name)\n\t\ton delete set null\n\t)'),
 ('index', 'sqlite_autoindex_course_1', 'course', 7, None),
 ('table', 'instructor', 'instructor', 8, 'CREATE TABLE instructor\n\t(ID\t\t\tvarchar(5), \n\t name\t\t\tvarchar(20) not null, \n\t dept_name\t\tvarchar(20), \n\t salary\t\t\tnumeric(8,2) check (salary > 29000),\n\t primary key (ID),\n\t foreign key (dept_name) references department (dept_name)\n\t\ton delete set null\n\t)'),
 ('index', 'sqlite_autoindex_instructor_1', 'instructor', 9, None),
 ('table', 'section', 'section', 10, "CREATE TABLE section\n\t(course_id\t\tvarchar(8), \n         sec_id\t\t\tvarchar(8),\n\t semester\t\tvarchar(6)\n\t\tcheck (semester in ('Fall', 'Win ... (285 characters truncated) ... (course_id)\n\t\ton delete cascade,\n\t foreign key (building, room_number) references classroom (building, room_number)\n\t\ton delete set null\n\t)"),
 ('index', 'sqlite_autoindex_section_1', 'section', 11, None),
 ('table', 'teaches', 'teaches', 12, 'CREATE TABLE teaches\n\t(ID\t\t\tvarchar(5), \n\t course_id\t\tvarchar(8),\n\t sec_id\t\t\tvarchar(8), \n\t semester\t\tvarchar(6),\n\t year\t\t\tnum ... (125 characters truncated) ... ences section (course_id, sec_id, semester, year)\n\t\ton delete cascade,\n\t foreign key (ID) references instructor (ID)\n\t\ton delete cascade\n\t)'),
 ('index', 'sqlite_autoindex_teaches_1', 'teaches', 13, None),
 ('table', 'student', 'student', 14, 'CREATE TABLE student\n\t(ID\t\t\tvarchar(5), \n\t name\t\t\tvarchar(20) not null, \n\t dept_name\t\tvarchar(20), \n\t tot_cred\t\tnumeric(3,0) check (tot_cred >= 0),\n\t primary key (ID),\n\t foreign key (dept_name) references department (dept_name)\n\t\ton delete set null\n\t)'),
 ('index', 'sqlite_autoindex_student_1', 'student', 15, None),
 ('table', 'takes', 'takes', 16, 'CREATE TABLE takes\n\t(ID\t\t\tvarchar(5), \n\t course_id\t\tvarchar(8),\n\t sec_id\t\t\tvarchar(8), \n\t semester\t\tvarchar(6),\n\t year\t\t\tnumer ... (153 characters truncated) ... ferences section (course_id, sec_id, semester, year)\n\t\ton delete cascade,\n\t foreign key (ID) references student (ID)\n\t\ton delete cascade\n\t)'),
 ('index', 'sqlite_autoindex_takes_1', 'takes', 17, None),
 ('table', 'advisor', 'advisor', 18, 'CREATE TABLE advisor\n\t(s_ID\t\t\tvarchar(5),\n\t i_ID\t\t\tvarchar(5),\n\t primary key (s_ID),\n\t foreign key (i_ID) references instructor (ID)\n\t\ton delete set null,\n\t foreign key (s_ID) references student (ID)\n\t\ton delete cascade\n\t)'),
 ('index', 'sqlite_autoindex_advisor_1', 'advisor', 19, None),
 ('table', 'time_slot', 'time_slot', 20, 'CREATE TABLE time_slot\n\t(time_slot_id\t\tvarchar(4),\n\t day\t\t\tvarchar(1),\n\t start_hr\t\tnumeric(2) check (start_hr >= 0 and start_hr < 24),\n ... (111 characters truncated) ... >= 0 and end_hr < 24),\n\t end_min\t\tnumeric(2) check (end_min >= 0 and end_min < 60),\n\t primary key (time_slot_id, day, start_hr, start_min)\n\t)'),
 ('index', 'sqlite_autoindex_time_slot_1', 'time_slot', 21, None),
 ('table', 'prereq', 'prereq', 22, 'CREATE TABLE prereq\n\t(course_id\t\tvarchar(8), \n\t prereq_id\t\tvarchar(8),\n\t primary key (course_id, prereq_id),\n\t foreign key (course_id) references course (course_id)\n\t\ton delete cascade,\n\t foreign key (prereq_id) references course (course_id)\n\t)'),
 ('index', 'sqlite_autoindex_prereq_1', 'prereq', 23, None)]

In [4]:
%sql select * from classroom

 * sqlite:///db_univ7.db
Done.

[('Packard', '101', 500),
 ('Painter', '514', 10),
 ('Taylor', '3128', 70),
 ('Watson', '100', 30),
 ('Watson', '120', 50)]

In [5]:
%sql select * from department

 * sqlite:///db_univ7.db
Done.

[('Biology', 'Watson', 90000),
 ('Comp. Sci.', 'Taylor', 100000),
 ('Elec. Eng.', 'Taylor', 85000),
 ('Finance', 'Painter', 120000),
 ('History', 'Painter', 50000),
 ('Music', 'Packard', 80000),
 ('Physics', 'Watson', 70000)]

In [6]:
%sql select * from course

 * sqlite:///db_univ7.db
Done.

[('BIO-101', 'Intro. to Biology', 'Biology', 4),
 ('BIO-301', 'Genetics', 'Biology', 4),
 ('BIO-399', 'Computational Biology', 'Biology', 3),
 ('CS-101', 'Intro. to Computer Science', 'Comp. Sci.', 4),
 ('CS-190', 'Game Design', 'Comp. Sci.', 4),
 ('CS-315', 'Robotics', 'Comp. Sci.', 3),
 ('CS-319', 'Image Processing', 'Comp. Sci.', 3),
 ('CS-347', 'Database System Concepts', 'Comp. Sci.', 3),
 ('EE-181', 'Intro. to Digital Systems', 'Elec. Eng.', 3),
 ('FIN-201', 'Investment Banking', 'Finance', 3),
 ('HIS-351', 'World History', 'History', 3),
 ('MU-199', 'Music Video Production', 'Music', 3),
 ('PHY-101', 'Physical Principles', 'Physics', 4)]

In [7]:
%sql select * from instructor

 * sqlite:///db_univ7.db
Done.

[('10101', 'Srinivasan', 'Comp. Sci.', 65000),
 ('12121', 'Wu', 'Finance', 90000),
 ('15151', 'Mozart', 'Music', 40000),
 ('22222', 'Einstein', 'Physics', 95000),
 ('32343', 'El Said', 'History', 60000),
 ('33456', 'Gold', 'Physics', 87000),
 ('45565', 'Katz', 'Comp. Sci.', 75000),
 ('58583', 'Califieri', 'History', 62000),
 ('76543', 'Singh', 'Finance', 80000),
 ('76766', 'Crick', 'Biology', 72000),
 ('83821', 'Brandt', 'Comp. Sci.', 92000),
 ('98345', 'Kim', 'Elec. Eng.', 80000),
 ('99998', 'Lee%', 'Biology', 90000),
 ('99999', 'Lee2', 'Biology', 90000)]

In [8]:
%sql select * from section

 * sqlite:///db_univ7.db
Done.

[('BIO-101', '1', 'Summer', 2017, 'Painter', '514', 'B'),
 ('BIO-301', '1', 'Summer', 2018, 'Painter', '514', 'A'),
 ('CS-101', '1', 'Fall', 2017, 'Packard', '101', 'H'),
 ('CS-101', '1', 'Spring', 2018, 'Packard', '101', 'F'),
 ('CS-190', '1', 'Spring', 2017, 'Taylor', '3128', 'E'),
 ('CS-190', '2', 'Spring', 2017, 'Taylor', '3128', 'A'),
 ('CS-315', '1', 'Spring', 2018, 'Watson', '120', 'D'),
 ('CS-319', '1', 'Spring', 2018, 'Watson', '100', 'B'),
 ('CS-319', '2', 'Spring', 2018, 'Taylor', '3128', 'C'),
 ('CS-347', '1', 'Fall', 2017, 'Taylor', '3128', 'A'),
 ('EE-181', '1', 'Spring', 2017, 'Taylor', '3128', 'C'),
 ('FIN-201', '1', 'Spring', 2018, 'Packard', '101', 'B'),
 ('HIS-351', '1', 'Spring', 2018, 'Painter', '514', 'C'),
 ('MU-199', '1', 'Spring', 2018, 'Packard', '101', 'D'),
 ('PHY-101', '1', 'Fall', 2017, 'Watson', '100', 'A')]

In [9]:
%sql select * from teaches

 * sqlite:///db_univ7.db
Done.

[('10101', 'CS-101', '1', 'Fall', 2017),
 ('10101', 'CS-315', '1', 'Spring', 2018),
 ('10101', 'CS-347', '1', 'Fall', 2017),
 ('12121', 'FIN-201', '1', 'Spring', 2018),
 ('15151', 'MU-199', '1', 'Spring', 2018),
 ('22222', 'PHY-101', '1', 'Fall', 2017),
 ('32343', 'HIS-351', '1', 'Spring', 2018),
 ('45565', 'CS-101', '1', 'Spring', 2018),
 ('45565', 'CS-319', '1', 'Spring', 2018),
 ('76766', 'BIO-101', '1', 'Summer', 2017),
 ('76766', 'BIO-301', '1', 'Summer', 2018),
 ('83821', 'CS-190', '1', 'Spring', 2017),
 ('83821', 'CS-190', '2', 'Spring', 2017),
 ('83821', 'CS-319', '2', 'Spring', 2018),
 ('98345', 'EE-181', '1', 'Spring', 2017)]

In [10]:
%sql select * from student

 * sqlite:///db_univ7.db
Done.

[('00128', 'Zhang', 'Comp. Sci.', 102),
 ('12345', 'Shankar', 'Comp. Sci.', 32),
 ('19991', 'Brandt', 'History', 80),
 ('23121', 'Chavez', 'Finance', 110),
 ('44553', 'Peltier', 'Physics', 56),
 ('45678', 'Levy', 'Physics', 46),
 ('54321', 'Williams', 'Comp. Sci.', 54),
 ('55739', 'Sanchez', 'Music', 38),
 ('70557', 'Snow', 'Physics', 0),
 ('76543', 'Brown', 'Comp. Sci.', 58),
 ('76653', 'Aoi', 'Elec. Eng.', 60),
 ('98765', 'Bourikas', 'Elec. Eng.', 98),
 ('98988', 'Tanaka', 'Biology', 120)]

In [11]:
%sql select * from takes

 * sqlite:///db_univ7.db
Done.

[('00128', 'CS-101', '1', 'Fall', 2017, 'A'),
 ('00128', 'CS-347', '1', 'Fall', 2017, 'A-'),
 ('12345', 'CS-101', '1', 'Fall', 2017, 'C'),
 ('12345', 'CS-190', '2', 'Spring', 2017, 'A'),
 ('12345', 'CS-315', '1', 'Spring', 2018, 'A'),
 ('12345', 'CS-347', '1', 'Fall', 2017, 'A'),
 ('19991', 'HIS-351', '1', 'Spring', 2018, 'B'),
 ('23121', 'FIN-201', '1', 'Spring', 2018, 'C+'),
 ('44553', 'PHY-101', '1', 'Fall', 2017, 'B-'),
 ('45678', 'CS-101', '1', 'Fall', 2017, 'F'),
 ('45678', 'CS-101', '1', 'Spring', 2018, 'B+'),
 ('45678', 'CS-319', '1', 'Spring', 2018, 'B'),
 ('54321', 'CS-101', '1', 'Fall', 2017, 'A-'),
 ('54321', 'CS-190', '2', 'Spring', 2017, 'B+'),
 ('55739', 'MU-199', '1', 'Spring', 2018, 'A-'),
 ('76543', 'CS-101', '1', 'Fall', 2017, 'A'),
 ('76543', 'CS-319', '2', 'Spring', 2018, 'A'),
 ('76653', 'EE-181', '1', 'Spring', 2017, 'C'),
 ('98765', 'CS-101', '1', 'Fall', 2017, 'C-'),
 ('98765', 'CS-315', '1', 'Spring', 2018, 'B'),
 ('98988', 'BIO-101', '1', 'Summer', 2017, 'A'),
 ('98988', 'BIO-301', '1', 'Summer', 2018, None)]

In [12]:
%sql select * from advisor

 * sqlite:///db_univ7.db
Done.

[('00128', '45565'),
 ('12345', '10101'),
 ('23121', '76543'),
 ('44553', '22222'),
 ('45678', '22222'),
 ('76543', '45565'),
 ('76653', '98345'),
 ('98765', '98345'),
 ('98988', '76766')]

In [13]:
%sql select * from time_slot

 * sqlite:///db_univ7.db
Done.

[('A', 'M', 8, 0, 8, 50),
 ('A', 'W', 8, 0, 8, 50),
 ('A', 'F', 8, 0, 8, 50),
 ('B', 'M', 9, 0, 9, 50),
 ('B', 'W', 9, 0, 9, 50),
 ('B', 'F', 9, 0, 9, 50),
 ('C', 'M', 11, 0, 11, 50),
 ('C', 'W', 11, 0, 11, 50),
 ('C', 'F', 11, 0, 11, 50),
 ('D', 'M', 13, 0, 13, 50),
 ('D', 'W', 13, 0, 13, 50),
 ('D', 'F', 13, 0, 13, 50),
 ('E', 'T', 10, 30, 11, 45),
 ('E', 'R', 10, 30, 11, 45),
 ('F', 'T', 14, 30, 15, 45),
 ('F', 'R', 14, 30, 15, 45),
 ('G', 'M', 16, 0, 16, 50),
 ('G', 'W', 16, 0, 16, 50),
 ('G', 'F', 16, 0, 16, 50),
 ('H', 'W', 10, 0, 12, 30)]

In [14]:
%sql select * from prereq

 * sqlite:///db_univ7.db
Done.

[('BIO-301', 'BIO-101'),
 ('BIO-399', 'BIO-101'),
 ('CS-190', 'CS-101'),
 ('CS-315', 'CS-101'),
 ('CS-319', 'CS-101'),
 ('CS-347', 'CS-101'),
 ('EE-181', 'PHY-101')]